<h1>Task 1</h1> - Introduction to pandas DataFrames (DF), joining DFs, Column names,

Let's start by importing the pandas library and referring to it as "pd",
shorthand for "pandas". The pandas library came with Anaconda, the package manager we use.

In [1]:
import pandas as pd

Here is a good place to start to find out more about pandas:
https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python

A "DataFrame" is a fundamental data strcture. We can create a "DF" with 5 columns and 2 rows, like this:

In [2]:
df1 = pd.DataFrame([[180121155814,-120.0,35.0,9,72.96],
                   [180121155815,-120.0, 36.0,10,73.5]])
# "df1" is a variable that refers to the DataFrame
# This cell won't print anything, it just does the work

In [3]:
# If we want to see it, we just have to type the variable name again
df1

              0      1     2   3      4
0  180121155814 -120.0  35.0   9  72.96
1  180121155815 -120.0  36.0  10  73.50

In [4]:
# Instead of numbers as column names, we can give them string names
df1.columns=['DateAndTimeStamp','lon','lat','sats','temp']
df1 # just print it here

   DateAndTimeStamp    lon   lat  sats   temp
0      180121155814 -120.0  35.0     9  72.96
1      180121155815 -120.0  36.0    10  73.50

Then, we could create a new DataFrame with 1 row and add the column names at the same time

In [5]:
df2 = pd.DataFrame([[180121155816,-120.0,37.0,9,73.96]],
               columns=['DateAndTimeStamp','lon','lat','sats','temp'])
df2 # Print

   DateAndTimeStamp    lon   lat  sats   temp
0      180121155816 -120.0  37.0     9  73.96

Then we could append the new DataFrame to the end of the first DataFrame, creating a new DataFrame (df3)

In [6]:
df3 = df1.append(df2)
df3 # Print

   DateAndTimeStamp    lon   lat  sats   temp
0      180121155814 -120.0  35.0     9  72.96
1      180121155815 -120.0  36.0    10  73.50
0      180121155816 -120.0  37.0     9  73.96

<h2>Your turn: create a new 2-row dataframe (just make up the actual data), df4, then append df4 to df3, creating df5</h2>